In [17]:
import pandas as pd
import datetime as dt

In [18]:
# import data

url="https://docs.google.com/spreadsheets/d/e/2PACX-1vQcpVvVioO23cndDwr1UmKhndrSq6ES6ZUKZ4fkBBqIAavd1_coVPO_yeOye-Ub-cAWlkX3psJvOU8o/pub?output=csv"

In [19]:
df = pd.read_csv(url)

In [20]:
df.head()

         date   meantemp   humidity  wind_speed  meanpressure
0  2013-01-01  10.000000  84.500000    0.000000   1015.666667
1  2013-01-02   7.400000  92.000000    2.980000   1017.800000
2  2013-01-03   7.166667  87.000000    4.633333   1018.666667
3  2013-01-04   8.666667  71.333333    1.233333   1017.166667
4  2013-01-05   6.000000  86.833333    3.700000   1016.500000

In [21]:
# add a datetime column with to_datetime pandas function to convert to datetime data type
df['datetime'] = pd.to_datetime(df['date'])

In [22]:
# verify changes
df.head()

         date   meantemp   humidity  wind_speed  meanpressure   datetime
0  2013-01-01  10.000000  84.500000    0.000000   1015.666667 2013-01-01
1  2013-01-02   7.400000  92.000000    2.980000   1017.800000 2013-01-02
2  2013-01-03   7.166667  87.000000    4.633333   1018.666667 2013-01-03
3  2013-01-04   8.666667  71.333333    1.233333   1017.166667 2013-01-04
4  2013-01-05   6.000000  86.833333    3.700000   1016.500000 2013-01-05

In [23]:
df.loc[0,'datetime']
df.loc[0,'datetime'].strftime('%B %d %Y')

'January 01 2013'

In [36]:
df.loc['2015':]

                  date   meantemp    humidity  wind_speed  meanpressure
datetime
2015-01-01  2015-01-01  14.750000   72.000000    0.925000   1017.500000
2015-01-02  2015-01-02  14.875000   96.625000    3.012500   1017.875000
2015-01-03  2015-01-03  15.125000   92.000000    0.925000   1017.375000
2015-01-04  2015-01-04  14.125000   78.750000    9.512500   1019.625000
2015-01-05  2015-01-05  14.000000   69.375000   15.050000   1016.000000
...                ...        ...         ...         ...           ...
2016-12-28  2016-12-28  17.217391   68.043478    3.547826   1015.565217
2016-12-29  2016-12-29  15.238095   87.857143    6.000000   1016.904762
2016-12-30  2016-12-30  14.095238   89.666667    6.266667   1017.904762
2016-12-31  2016-12-31  15.052632   87.000000    7.325000   1016.100000
2017-01-01  2017-01-01  10.000000  100.000000    0.000000   1016.000000

[732 rows x 5 columns]

### Custom Formats and Errors

In [40]:
# import data
demo = pd.read_csv('https://docs.google.com/spreadsheets/d/e/2PACX-1vT_jChgNsQbHbg4TGepzIqk8XC9DTIKmyyxb1upo5cfZCgbfIUQc2ZC0YMzuU5uApP140Ob49KBjdqh/pub?gid=1198589591&single=true&output=csv', usecols=[0,1])
demo

           date  cloud_cover
0      19790101          2.0
1      19790102          6.0
2      19790103          5.0
3      19790104          8.0
4      19790105          6.0
...         ...          ...
15336  20201227          1.0
15337  20201228          7.0
15338  20201229          7.0
15339  20201230          6.0
15340  20201231          7.0

[15341 rows x 2 columns]

In [42]:
pd.to_datetime(demo['date'], format = '%Y%m%d')

0       1979-01-01
1       1979-01-02
2       1979-01-03
3       1979-01-04
4       1979-01-05
           ...
15336   2020-12-27
15337   2020-12-28
15338   2020-12-29
15339   2020-12-30
15340   2020-12-31
Name: date, Length: 15341, dtype: datetime64[ns]

#### Baltimore Crime Data

In [43]:
# import data

baltimore = pd.read_csv('https://docs.google.com/spreadsheets/d/e/2PACX-1vQ4lekzpYpo0pA9h1d3KYObIb3lQtAqz289c7jpwckioXvxm4xykz6ZSJpnDwjKTxJ4iqpG0seNJdSZ/pub?gidass=>=312387697&single=true&output=csv')

In [44]:
baltimore

,CrimeDateTime,Description,District,Latitude,Longitude
0,2022/07/09 09:30:00+00,ROBBERY - RESIDENCE,NORTHEAST,39.3223,-76.5467
1,2022/07/09 16:00:00+00,COMMON ASSAULT,SOUTHERN,39.2821,-76.6355
2,2022/07/09 00:34:28+00,SHOOTING,SOUTHWEST,39.2884,-76.6569
3,2022/07/09 00:34:28+00,SHOOTING,SOUTHWEST,39.2884,-76.6569
4,2022/07/09 18:00:00+00,COMMON ASSAULT,NORTHEAST,39.3188,-76.5872
...,...,...,...,...,...
527812,2013/07/31 17:45:00+00,AUTO THEFT,NORTHERN,39.3330,-76.6282
527813,2013/07/31 14:15:00+00,LARCENY,NORTHWEST,39.3180,-76.6582
527814,2013/07/31 21:00:00+00,COMMON ASSAULT,NORTHEAST,39.3431,-76.5948
527815,2013/07/31 17:00:00+00,BURGLARY,NORTHWEST,39.3186,-76.6886
527816,2013/07/31 11:40:00+00,COMMON ASSAULT,EASTERN,39.2952,-76.5986